W10D1/goal_app/app/models/user.rb

    def self.find_by_credentials(username, password)
      user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "someuser"], ["LIMIT", 1]]

    def reset_session_token!
      self.session_token = User.generate_session_token
      self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "satrqc9ftxngd7BFvWfklA"], ["updated_at", "2019-09-02 22:32:27.365869"], ["id", 2]]