W9D3/Cats_2_99/app/views/cats/index.html.erb

SELECT "cats".* FROM "cats"
---

<!-- @cats.first.atrributes.keys - Cat.protected_attributes.to_a -->