W9D1/first_routes/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
        user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "jill"], ["email", "jill@yahoo.com"], ["id", 3]]

    def destroy
        user = User.find(params[:id])
        user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]