W10D4/reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
    <p>Subs</p>
    <% Sub.all.each do |sub| %>