W9D2/Art_share_01/app/controllers/artworks_controller.rb

  def update
      artwork = Artwork.find(params[:id])


      if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Cat"], ["image_url", "imgur.com/C"], ["updated_at", "2019-08-27 21:02:46.876876"], ["id", 7]]