W9D2/Art_share_01/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "jill"], ["email", "jill@yahoo.com"], ["id", 3]]