W9D3/Cats_2_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cat = Cat.find_by_id(params[:id]) #maybe find?