W13D4/Todos/app/controllers/api/todos_controller.rb

  def update
    @todo = Todo.find(params[:id])
    if @todo.update_attributes(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "Bob"], ["body", "Builder"], ["updated_at", "2019-09-26 21:28:47.182303"], ["id", 1]]