W9D2/Art_share_02/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 9], ["created_at", "2019-08-27 21:45:12.308944"], ["updated_at", "2019-08-27 21:45:12.308944"]]
---
  def create
      artworkshare = ArtworkShare.new(artworkshare_params)
      if artworkshare.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]
---
  def destroy
      artworkshare = ArtworkShare.find(params[:id])
      artworkshare.destroy