W9D2/Art_share_02/app/controllers/comments_controller.rb

  def index
    # user
    # artwork
    #render json: {user_comments: user.comments, artwork_comments: artwork.comments}
    if user = User.find(params[:author][:author_id])
        render json: user.comments
    elsif artwork = Artwork.find(params[:artwork][:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]