W10D4/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    debugger
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "adsadsa"], ["url", "asdsad"], ["content", "asdasd"], ["sub_id", 1], ["user_id", 3], ["created_at", "2019-09-05 22:25:46.990233"], ["updated_at", "2019-09-05 22:25:46.990233"]]